var clients = [ {
	"学号" : "2016011xxx",
	"姓名" : "嘟嘟暴龙",
	"活动1" : '嘟嘟暴龙的第一个活动',
	"分数" : 1,
	"活动2" : "嘟嘟暴龙的第二个活动",
	"分数" : 1,
	"活动3" : "嘟嘟暴龙的第三个活动",
	"分数" : 1,
	"活动4" : "嘟嘟暴龙的第四个活动",
	"分数" : 1,
	"活动5" : "嘟嘟暴龙的第五个活动",
	"分数" : 1,
	"总分" : 5
}, {
	"学号" : "2016011xxx",
	"姓名" : "嘟嘟暴龙",
	"活动1" : '嘟嘟暴龙的第一个活动',
	"分数" : 1,
	"活动2" : "嘟嘟暴龙的第二个活动",
	"分数" : 1,
	"活动3" : "嘟嘟暴龙的第三个活动",
	"分数" : 1,
	"活动4" : "嘟嘟暴龙的第四个活动",
	"分数" : 1,
	"活动5" : "嘟嘟暴龙的第五个活动",
	"分数" : 1,
	"总分" : 5
}, {
	"学号" : "2016011xxx",
	"姓名" : "嘟嘟暴龙",
	"活动1" : '嘟嘟暴龙的第一个活动',
	"分数" : 1,
	"活动2" : "嘟嘟暴龙的第二个活动",
	"分数" : 1,
	"活动3" : "嘟嘟暴龙的第三个活动",
	"分数" : 1,
	"活动4" : "嘟嘟暴龙的第四个活动",
	"分数" : 1,
	"活动5" : "嘟嘟暴龙的第五个活动",
	"分数" : 1,
	"总分" : 5
}, {
	"学号" : "2016011xxx",
	"姓名" : "嘟嘟暴龙",
	"活动1" : '嘟嘟暴龙的第一个活动',
	"分数" : 1,
	"活动2" : "嘟嘟暴龙的第二个活动",
	"分数" : 1,
	"活动3" : "嘟嘟暴龙的第三个活动",
	"分数" : 1,
	"活动4" : "嘟嘟暴龙的第四个活动",
	"分数" : 1,
	"活动5" : "嘟嘟暴龙的第五个活动",
	"分数" : 1,
	"总分" : 5
}, {
	"学号" : "2016011xxx",
	"姓名" : "嘟嘟暴龙",
	"活动1" : '嘟嘟暴龙的第一个活动',
	"分数" : 1,
	"活动2" : "嘟嘟暴龙的第二个活动",
	"分数" : 1,
	"活动3" : "嘟嘟暴龙的第三个活动",
	"分数" : 1,
	"活动4" : "嘟嘟暴龙的第四个活动",
	"分数" : 1,
	"活动5" : "嘟嘟暴龙的第五个活动",
	"分数" : 1,
	"总分" : 5
}, {
	"学号" : "2016011xxx",
	"姓名" : "嘟嘟暴龙",
	"活动1" : '嘟嘟暴龙的第一个活动',
	"分数" : 1,
	"活动2" : "嘟嘟暴龙的第二个活动",
	"分数" : 1,
	"活动3" : "嘟嘟暴龙的第三个活动",
	"分数" : 1,
	"活动4" : "嘟嘟暴龙的第四个活动",
	"分数" : 1,
	"活动5" : "嘟嘟暴龙的第五个活动",
	"分数" : 1,
	"总分" : 5
}, {
	"学号" : "2016011xxx",
	"姓名" : "嘟嘟暴龙",
	"活动1" : '嘟嘟暴龙的第一个活动',
	"分数" : 1,
	"活动2" : "嘟嘟暴龙的第二个活动",
	"分数" : 1,
	"活动3" : "嘟嘟暴龙的第三个活动",
	"分数" : 1,
	"活动4" : "嘟嘟暴龙的第四个活动",
	"分数" : 1,
	"活动5" : "嘟嘟暴龙的第五个活动",
	"分数" : 1,
	"总分" : 5
}, {
	"学号" : "2016011xxx",
	"姓名" : "嘟嘟暴龙",
	"活动1" : '嘟嘟暴龙的第一个活动',
	"分数" : 1,
	"活动2" : "嘟嘟暴龙的第二个活动",
	"分数" : 1,
	"活动3" : "嘟嘟暴龙的第三个活动",
	"分数" : 1,
	"活动4" : "嘟嘟暴龙的第四个活动",
	"分数" : 1,
	"活动5" : "嘟嘟暴龙的第五个活动",
	"分数" : 1,
	"总分" : 5
}, {
	"学号" : "2016011xxx",
	"姓名" : "嘟嘟暴龙",
	"活动1" : '嘟嘟暴龙的第一个活动',
	"分数" : 1,
	"活动2" : "嘟嘟暴龙的第二个活动",
	"分数" : 1,
	"活动3" : "嘟嘟暴龙的第三个活动",
	"分数" : 1,
	"活动4" : "嘟嘟暴龙的第四个活动",
	"分数" : 1,
	"活动5" : "嘟嘟暴龙的第五个活动",
	"分数" : 1,
	"总分" : 5
}, {
	"学号" : "2016011xxx",
	"姓名" : "嘟嘟暴龙",
	"活动1" : '嘟嘟暴龙的第一个活动',
	"分数" : 1,
	"活动2" : "嘟嘟暴龙的第二个活动",
	"分数" : 1,
	"活动3" : "嘟嘟暴龙的第三个活动",
	"分数" : 1,
	"活动4" : "嘟嘟暴龙的第四个活动",
	"分数" : 1,
	"活动5" : "嘟嘟暴龙的第五个活动",
	"分数" : 1,
	"总分" : 5
}, {
	"学号" : "2016011xxx",
	"姓名" : "嘟嘟暴龙",
	"活动1" : '嘟嘟暴龙的第一个活动',
	"分数" : 1,
	"活动2" : "嘟嘟暴龙的第二个活动",
	"分数" : 1,
	"活动3" : "嘟嘟暴龙的第三个活动",
	"分数" : 1,
	"活动4" : "嘟嘟暴龙的第四个活动",
	"分数" : 1,
	"活动5" : "嘟嘟暴龙的第五个活动",
	"分数" : 1,
	"总分" : 5
}, {
	"学号" : "2016011xxx",
	"姓名" : "嘟嘟暴龙",
	"活动1" : '嘟嘟暴龙的第一个活动',
	"分数" : 1,
	"活动2" : "嘟嘟暴龙的第二个活动",
	"分数" : 1,
	"活动3" : "嘟嘟暴龙的第三个活动",
	"分数" : 1,
	"活动4" : "嘟嘟暴龙的第四个活动",
	"分数" : 1,
	"活动5" : "嘟嘟暴龙的第五个活动",
	"分数" : 1,
	"总分" : 5
}, {
	"学号" : "2016011xxx",
	"姓名" : "嘟嘟暴龙",
	"活动1" : '嘟嘟暴龙的第一个活动',
	"分数" : 1,
	"活动2" : "嘟嘟暴龙的第二个活动",
	"分数" : 1,
	"活动3" : "嘟嘟暴龙的第三个活动",
	"分数" : 1,
	"活动4" : "嘟嘟暴龙的第四个活动",
	"分数" : 1,
	"活动5" : "嘟嘟暴龙的第五个活动",
	"分数" : 1,
	"总分" : 5
}, {
	"学号" : "2016011xxx",
	"姓名" : "嘟嘟暴龙",
	"活动1" : '嘟嘟暴龙的第一个活动',
	"分数" : 1,
	"活动2" : "嘟嘟暴龙的第二个活动",
	"分数" : 1,
	"活动3" : "嘟嘟暴龙的第三个活动",
	"分数" : 1,
	"活动4" : "嘟嘟暴龙的第四个活动",
	"分数" : 1,
	"活动5" : "嘟嘟暴龙的第五个活动",
	"分数" : 1,
	"总分" : 5
}, {
	"学号" : "2016011xxx",
	"姓名" : "嘟嘟暴龙",
	"活动1" : '嘟嘟暴龙的第一个活动',
	"分数" : 1,
	"活动2" : "嘟嘟暴龙的第二个活动",
	"分数" : 1,
	"活动3" : "嘟嘟暴龙的第三个活动",
	"分数" : 1,
	"活动4" : "嘟嘟暴龙的第四个活动",
	"分数" : 1,
	"活动5" : "嘟嘟暴龙的第五个活动",
	"分数" : 1,
	"总分" : 5
}, {
	"学号" : "2016011xxx",
	"姓名" : "嘟嘟暴龙",
	"活动1" : '嘟嘟暴龙的第一个活动',
	"分数" : 1,
	"活动2" : "嘟嘟暴龙的第二个活动",
	"分数" : 1,
	"活动3" : "嘟嘟暴龙的第三个活动",
	"分数" : 1,
	"活动4" : "嘟嘟暴龙的第四个活动",
	"分数" : 1,
	"活动5" : "嘟嘟暴龙的第五个活动",
	"分数" : 1,
	"总分" : 5
}, {
	"学号" : "2016011xxx",
	"姓名" : "嘟嘟暴龙",
	"活动1" : '嘟嘟暴龙的第一个活动',
	"分数" : 1,
	"活动2" : "嘟嘟暴龙的第二个活动",
	"分数" : 1,
	"活动3" : "嘟嘟暴龙的第三个活动",
	"分数" : 1,
	"活动4" : "嘟嘟暴龙的第四个活动",
	"分数" : 1,
	"活动5" : "嘟嘟暴龙的第五个活动",
	"分数" : 1,
	"总分" : 5
}, {
	"学号" : "2016011xxx",
	"姓名" : "嘟嘟暴龙",
	"活动1" : '嘟嘟暴龙的第一个活动',
	"分数" : 1,
	"活动2" : "嘟嘟暴龙的第二个活动",
	"分数" : 1,
	"活动3" : "嘟嘟暴龙的第三个活动",
	"分数" : 1,
	"活动4" : "嘟嘟暴龙的第四个活动",
	"分数" : 1,
	"活动5" : "嘟嘟暴龙的第五个活动",
	"分数" : 1,
	"总分" : 5
}, {
	"学号" : "2016011xxx",
	"姓名" : "嘟嘟暴龙",
	"活动1" : '嘟嘟暴龙的第一个活动',
	"分数" : 1,
	"活动2" : "嘟嘟暴龙的第二个活动",
	"分数" : 1,
	"活动3" : "嘟嘟暴龙的第三个活动",
	"分数" : 1,
	"活动4" : "嘟嘟暴龙的第四个活动",
	"分数" : 1,
	"活动5" : "嘟嘟暴龙的第五个活动",
	"分数" : 1,
	"总分" : 5
}, {
	"学号" : "2016011xxx",
	"姓名" : "嘟嘟暴龙",
	"活动1" : '嘟嘟暴龙的第一个活动',
	"分数" : 1,
	"活动2" : "嘟嘟暴龙的第二个活动",
	"分数" : 1,
	"活动3" : "嘟嘟暴龙的第三个活动",
	"分数" : 1,
	"活动4" : "嘟嘟暴龙的第四个活动",
	"分数" : 1,
	"活动5" : "嘟嘟暴龙的第五个活动",
	"分数" : 1,
	"总分" : 5
}, {
	"学号" : "2016011xxx",
	"姓名" : "嘟嘟暴龙",
	"活动1" : '嘟嘟暴龙的第一个活动',
	"分数" : 1,
	"活动2" : "嘟嘟暴龙的第二个活动",
	"分数" : 1,
	"活动3" : "嘟嘟暴龙的第三个活动",
	"分数" : 1,
	"活动4" : "嘟嘟暴龙的第四个活动",
	"分数" : 1,
	"活动5" : "嘟嘟暴龙的第五个活动",
	"分数" : 1,
	"总分" : 5
}, {
	"学号" : "2016011xxx",
	"姓名" : "嘟嘟暴龙",
	"活动1" : '嘟嘟暴龙的第一个活动',
	"分数" : 1,
	"活动2" : "嘟嘟暴龙的第二个活动",
	"分数" : 1,
	"活动3" : "嘟嘟暴龙的第三个活动",
	"分数" : 1,
	"活动4" : "嘟嘟暴龙的第四个活动",
	"分数" : 1,
	"活动5" : "嘟嘟暴龙的第五个活动",
	"分数" : 1,
	"总分" : 5
},

];
$("#jsGrid").jsGrid({
	inserting : true,
	editing : true,
	sorting : true,
	paging : true,
	data : clients,

	fields : [ {
		name : "学号",
		type : "text"
	}, {
		name : "姓名",
		type : "text"
	}, {
		name : "活动1",
		type : "text"
	}, {
		name : "分数",
		type : "number",
		width : 50
	}, {
		name : "活动2",
		type : "text"
	}, {
		name : "分数",
		type : "number",
		width : 50
	}, {
		name : "活动3",
		type : "text"
	}, {
		name : "分数",
		type : "number",
		width : 50
	}, {
		name : "活动4",
		type : "text"
	}, {
		name : "分数",
		type : "number",
		width : 50
	}, {
		name : "活动5",
		type : "text"
	}, {
		name : "分数",
		type : "number",
		width : 50
	}, {
		name : "总分",
		type : "number",
		width : 50
	}, {
		type : "control"
	} ]
});